//Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 
//Первоначальный массив можно ввести с клавиатуры, 
//либо задать на старте выполнения алгоритма. 
//При решении не рекомендуется пользоваться коллекциями, 
//лучше обойтись исключительно массивами.
string[] array1 = new string[6] {"hello", "94", "sunshine", "inspitation", "tea","fog"};
string[] array2 = new string[array1.Length];
void SecondArray(string[] array1, string[] array2)